In [4]:
import numpy as np
import pandas as pd
dataFrame = pd.DataFrame(np.arange(16).reshape((4,4)),
             index=['台北','台中','台南', '高雄'],
             columns=['one', 'two', 'three', 'four']
             )
dataFrame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [5]:
#subscript選取欄位
dataFrame['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [6]:
dataFrame[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [7]:
dataFrame[['one','three']]

    one  three
台北    0      2
台中    4      6
台南    8     10
高雄   12     14

In [10]:
dataFrame['one'][['台北','台中']]

台北    0
台中    4
Name: one, dtype: int64